
# Список тексту для сторінок блакнота, де
#   індекс вказує на номер сторінки, а словарі на текст який буде відображуватись на сторінках,
#   і на тип цього тексту

journal_pages_text = [
    [
        {"text": ["Ми вирішили впустити цих людей", "Це були наші сусіди, які хотіли дізнатися чи все в нас добре."], "type": "event_neighbors_let_y"},
        {"text": ["Ми вирішили не пускати цих незнайомців.", "Хто зна що вони від нас хотіли!"], "type": "event_neighbors_let_n"},

        {"text": ["Ми вирішили впустити цих людей", "Це були вори, вони відштовхнули нас і.", "забрали у нас 1 банку супа."],"taken_items": {"food_can": 1}, "type": "event_strangers_let_y"},
        {"text": ["Ми вирішили не пускати цих незнайомців.", "Ми вважаємо, що у такі складні часи", "не можна пускати кого завгодно."], "type": "event_strangers_let_n"},

        {"text": ["Ми зібрались з силами і подивились, що там.", "На щастя це був лише товстий щур, який там застряг.", ], "type": "event_ventilation_check_y"},
        {"text": ["Ми вирішили не дивитись що там.", "Хто зна що це було.", ], "type": "event_ventilation_check_n"},

        {"text": ["Ми вирішили взяти трубку і дізнатися", "хто ж нам дзвонить. Це була тітка Наташа!", "Вона хотіла дізнатися як ми. Також вона", "сказала, що рятувати нас ніхто не торопиться,", "оскільки уряд скриває цю аварію."], "type": "event_telephone_ringing_y"},
        {"text": ["Ми вирішили не ризикувати здоров'ям.", "Не факт що цей дзвінок вартий цього.", ], "type": "event_telephone_ringing_n"},

        {"text": ["Ми вирішили довіритись цим людям і випробувати", "свою удачу.", "Після того як ми відкрили дверь укриття, ці люди дали нам банку супа і", "пляшку води"],"given_items": {"food_can": 1, "water_bottle": 1}, "type": "event_people_giving_food_y"},
        {"text": ["Ми вирішили не ризикувати нашею цілістністю,", "і цілісністю припасів. Ми їм сказали, що не поведемось", "на цю брехню, і прогнали їх."], "type": "event_people_giving_food_n"},

        {"text": ["Діма з'їхав з глузду без води.", "Він вирішив піти сам у пустоші у пошуках води.", "Навряд чи він повернеться."], "type": "dima_0_thirst"},
        {"text": ["Сьогодні зранку Даша сказала, що", "їй набридло те, що ми не поїмо її. Вона вирі-", "шила піти у пустоші у пошуках води.", "Ми не думаємо, що вона повернеться."], "type": "dasha_0_thirst"},
        {"text": ["Олег з зневоднення вирішив піти сам на", "пошуки води, навряд чи він повернеться."], "type": "oleg_0_thirst"},
        {"text": ["Маша більш не смогла терпіти зневоднен-", "ня, і вирішила піти на пошуки води у пустоші.", "Ми не думаємо, що вона повернеться."], "type": "masha_0_thirst"},

        {"text": ["Діма одичав без їжі, і сказав що", "він вирішив піти сам у пустоші у пошуках їжі.", "Навряд чи він повернеться."], "type": "dima_0_hunger"},
        {"text": ["Сьогодні зранку Даша сказала, що", "вона більш не протягне без їжі, і пішла у пустоші.", "Ми не думаємо, що вона повернеться."], "type": "dasha_0_hunger"},
        {"text": ["Олег з голодування вирішив піти сам на", "пошуки їжі, навряд чи він повернеться."], "type": "oleg_0_hunger"},
        {"text": ["Маша більш не смогла терпіти цю голодовку,", "і вирішила піти на пошуки їжі у пустоші.", "Ми не думаємо, що вона повернеться."], "type": "masha_0_hunger"},

        {"text": ["Ми намагаємось не зійти з глузду у цьому укритті. ","Поки начебто виходить"], "type": "text"},
        {"text": ["Сьогодні все було добре! Ну якщо не враховувати що наше сховище", "походить на зоопарк, де замість тварин різні види комах."], "type": "text"},
        {"text": ["День проходить нормально, ну наскільки не можливо в укритті", "у місті де був вибух атомної електростанції"], "type": "text"},
        {"text": ["Сьогодні ми побачили велечезного щура.", "Це найцікавіше, що можна тут побачити."], "type": "text"},
        {"text": ["Як же ми любимо суп. Суп це найкраща страва з усіх існуючих.", "Це настільки чудова страва, що ми вже бачимо", "його у своїх сновідіннях."], "type": "text"},
        {"text": ["Іноді нам стає цікаво, хто ж обітає там, на поверхні.", "Може там гігантські щури зайняли місце людей.", "Води ходять на роботу, кормлять свої сім'ї.", "Походу ми вже з'їджаємо з глузду раз у нас такі думи."], "type": "text"},
        {"text": ["Цікаво, коли вже уряд візьметься за евакуацію міста?", "Ми тримаємо кулачки і надіємось, що це станеться скоро."], "type": "text"}
    ],
    [{"text": ["Час розподіляти запаси!"], "type": "feed_water"}],

    [{"text": ["Запаси у нашому укритті нажаль не нескінченні.", "Тому час нам обирати: йти за припаси чи ні."], "type": "expedition_plan"},
     {"text": ["Вчора ми зібрались з силами і вирішили вийти за припасами.", "Тепер треба обрати хто саме вийде наружу."], "type": "expedition_character_choice"},
     {"text": ["Ми маємо надію, що експедиція проходить безпечно.", "Вже чекаємо на нову банку супу чи води."], "type": "text"},
     {"text": ["Нарешті Діма повернувся з екпедиції! ","Він приніс нам деякі припаси."], "type": "expedition_end_dima"},
    {"text": ["Нарешті Олег повернувся з екпедиції! ","Він приніс нам деякі припаси."], "type": "expedition_end_oleg"},
    {"text": ["Нарешті Даша повернулась з екпедиції! ","Вона принісла нам деякі припаси."], "type": "expedition_end_dasha"},
    {"text": ["Нарешті Маша повернулась з екпедиції! ","Вона принісла нам деякі припаси."], "type": "expedition_end_masha"}
    ],
    [
        {"text": ["Поки ми сиділи і думали, чим поснідати - супом чи супом,", "у дверь нашого сховища постучали незнайомі люди, і попро-", 
                  "сили їх впустити щоб вони могли нам щось сказати.", "", "                        Впустити їх?"], "type": "event_neighbors_let"},
        {"text": ["День проходив як звичайно, але в один момент", "у дверь нашого сховища постучали дивні люди, і попро-", 
                  "сили їх впустити щоб вони могли нам щось сказати.","Ми не можемо впізнати їх голос.", "", "                        Впустити їх?"], "type": "event_strangers_let"},
        {"text": ["Нам не просто, але ми намагаємось триматись", "з усіх сил."], "type": "text"}, 
        {"text": ["Сьогоднішній день дуже схож на минулий і передминулий.", "Може це співпадіння?"], "type": "text"},
        {"text": ["Сьогодні ми прокинулись через якісь невідомий шум.", "Нам стало лячно, но в одночас цікаво.","", "                        Подивитись що там?"], "type": "event_ventilation_check"},
        {"text": ["Цікаво, чи є на поверхні інші страви, окрім супу?"], "type": "text"},
        {"text": ["Поки ми сіділи в укритті, ми почули дивний звук.", "Причувшись ми зрозуміли, що хтось дзвонить на наш","домашній телефон, який знаходиться на поверхні.", "", "                        Піднятись щоб взяти трубку?"], "type": "event_telephone_ringing"},
        {"text": ["З поверхні ми почули незнайомі голоси, які назвалися 'Промінем світла'.", "Вони заявляють, що вони представляють собою", "благодійну організацію, яка жертвує припаси.", "Але ніхто не знає що в них на умі насправді.","", "                        Чи треба їх пустити?"], "type": "event_people_giving_food"}
    ]
]
